In [1]:
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import matplotlib.mlab as mlab
import matplotlib

plt.style.use('ggplot')
from matplotlib.pyplot import figure

In [2]:
#Read the data file
file_path_train = "/Users/cheehwapang/Downloads/train.csv"
file_path_test = "/Users/cheehwapang/Downloads/test.csv"
train = pd.read_csv(file_path_train)
test = pd.read_csv(file_path_test)

In [3]:
# Describe train data file info, dtype and non-null count
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
# Describe test data file info, dtype and non-null count
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [5]:
#Show train table first 5 rows 
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
#Shows test table first 5 rows
test.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
train.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [8]:
train.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [9]:
train.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [10]:
#Drop some column which not needed for baseline ML model for both train and testfile
#Drop the below attr as too many single count and not helpful to train the ML model
train.drop(["Name","Ticket","Cabin"], inplace=True, axis=1)
test.drop(["Name","Ticket","Cabin"], inplace=True, axis=1)

In [11]:
#Data file train and test info after drop unwanted attr
print(train.info(), test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 62.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          332 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         417 non-null    float64
 7   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 26.2+ KB
None None

In [12]:
#From the above table, observed Age, Embarked, Fare have Non-NULL value in train and test data file
train.Embarked.value_counts()
#Below table shows most of is belong to S category, hence assign the 2 Null Value to S

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [13]:
train.Fare.value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: Fare, Length: 248, dtype: int64

In [14]:
train.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [15]:
#Fill the null value in Embarked with S, Fare & Age with its mean value
data = [train, test]

for dataset in data:
    dataset.Embarked = dataset.Embarked.fillna('S')
    dataset.Fare = dataset.Fare.fillna(dataset.Fare.mean())
    dataset.Age = dataset.Age.fillna(dataset.Age.mean())

In [16]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [17]:
test.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [18]:
train.Embarked.value_counts()
#Embarked 2 Null Value item have updated to S

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [19]:
#Data PreProcessing on 2 features - Age and Fare
train[['Age','Survived']].groupby(['Age'], as_index = False).mean().sort_values(by='Survived', ascending = False)

      Age  Survived
0    0.42       1.0
9    5.00       1.0
80  63.00       1.0
69  53.00       1.0
1    0.67       1.0
..    ...       ...
50  36.50       0.0
32  24.50       0.0
47  34.50       0.0
41  30.50       0.0
19  14.50       0.0

[89 rows x 2 columns]

In [20]:
#Divide the Fare into 5 groups by qcut and each group almost evenly distributed
tempFare = train.Fare
tempFare = pd.qcut(tempFare, 5)
tempFare.value_counts()

(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: Fare, dtype: int64

In [21]:
data = [train, test]

for dataset in data:
    dataset.loc[(dataset['Fare'] <=7.854), 'Fare'] = 0
    dataset.loc[(dataset['Fare'] >7.854) & (dataset['Fare'] <= 10.5), 'Fare'] = 1
    dataset.loc[(dataset['Fare'] >10.5) & (dataset['Fare'] <= 21.679), 'Fare'] = 2
    dataset.loc[(dataset['Fare'] >21.679) & (dataset['Fare'] <= 39.688), 'Fare'] = 3
    dataset.loc[(dataset['Fare'] >39.688), 'Fare'] = 4
    dataset.Fare = dataset['Fare'].astype(int)
    
train.Fare.value_counts()

1    197
3    181
4    176
2    171
0    166
Name: Fare, dtype: int64

In [22]:
#Divide the Age into 5 groups by qcut
tempAge = train.Age
tempAge = pd.qcut(tempAge, 5)
tempAge.value_counts()

(28.0, 29.699]    199
(20.0, 28.0]      183
(0.419, 20.0]     179
(38.0, 80.0]      177
(29.699, 38.0]    153
Name: Age, dtype: int64

In [23]:
data = [train, test]

for dataset in data:
    dataset.loc[(dataset['Age'] <=20.0), 'Age'] = 0
    dataset.loc[(dataset['Age'] >20.0) & (dataset['Age'] <= 28.0), 'Age'] = 1
    dataset.loc[(dataset['Age'] >28.0) & (dataset['Age'] <= 29.699), 'Age'] = 2
    dataset.loc[(dataset['Age'] >29.699) & (dataset['Age'] <= 38.0), 'Age'] = 3
    dataset.loc[(dataset['Age'] >38.0), 'Age'] = 4
    dataset.Age = dataset['Age'].astype(int)
    
train.Age.value_counts()

3    330
1    183
0    179
4    177
2     22
Name: Age, dtype: int64

In [24]:
#Data After Processing on 2 features - Age and Fare
train[['Age','Survived']].groupby(['Age'], as_index = False).mean().sort_values(by='Survived', ascending = False)

   Age  Survived
0    0  0.458101
4    4  0.372881
2    2  0.363636
3    3  0.363636
1    1  0.360656

In [25]:
#Data After Processing on 2 features - Age and Fare
train[['Fare','Survived']].groupby(['Fare'], as_index = False).mean().sort_values(by='Survived', ascending = False)

   Fare  Survived
4     4  0.642045
3     3  0.441989
2     2  0.426901
0     0  0.216867
1     1  0.203046

In [26]:
#Convert object type feature/attr like Sex and Embarked into Numeric feature
genderMap = {"male":0, "female":1}
embarkedMap = {"S":0, "C":1, "Q":2}
data = [train, test]

for dataset in data:
    dataset['Sex'] = dataset['Sex'].map(genderMap)
    dataset['Embarked'] = dataset['Embarked'].map(embarkedMap)

In [27]:
#train.Sex.value_counts()
#test.Embarked.value_counts()

In [28]:
#Method 2: transform Sex and Embarked to a numeric Value by using sklearn method
"""
from sklearn import preprocessing
le = preprocessing.LabelEncoder()

cols = ["Sex", "Embarked"]

for col in cols:
    train[col] = le.fit_transform(train[col])
    test[col] = le.transform(test[col])
    print(le.classes_)

train.head(3)
"""

'\nfrom sklearn import preprocessing\nle = preprocessing.LabelEncoder()\n\ncols = ["Sex", "Embarked"]\n\nfor col in cols:\n    train[col] = le.fit_transform(train[col])\n    test[col] = le.transform(test[col])\n    print(le.classes_)\n\ntrain.head(3)\n'

In [29]:
#Check the data info after data cleaning, no Null Value and all in int64
print(train.info(),test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    int64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    int64
 8   Embarked     891 non-null    int64
dtypes: int64(9)
memory usage: 62.8 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    int64
 3   Age          418 non-null    int64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         418 non-null    int64
 7   Embarked     418 non-null    int64
dtypes: int64(8)
memory usage: 26.2 KB
None None

In [30]:
#Seperating X's and Y's feature and label
X_train = train.drop(['Survived', 'PassengerId'], axis=1)
Y_train = train['Survived']

In [31]:
X_test = test.drop('PassengerId', axis=1)

In [32]:
#Select a model and train it
#1. Logistic Regression
from sklearn.linear_model import LogisticRegression

clf_lr = LogisticRegression(random_state=0)
clf_lr.fit(X_train, Y_train)
acc_logistic = round(clf_lr.score(X_train, Y_train)*100, 2)
print(acc_logistic)

80.81

In [33]:
#2. SVM
from sklearn.svm import SVC

clf_svm = SVC()
clf_svm.fit(X_train, Y_train)
acc_svm = round(clf_svm.score(X_train, Y_train)*100, 2)
print(acc_svm)

81.93

In [34]:
#3. Gaussian Naive Bayes
from sklearn.naive_bayes import GaussianNB

clf_gnb = GaussianNB()
clf_gnb.fit(X_train, Y_train)
acc_gnb = round(clf_gnb.score(X_train, Y_train)*100, 2)
print(acc_gnb)

76.88

In [35]:
#4. Ridge classifier
from sklearn.linear_model import RidgeClassifier

clf_rc = RidgeClassifier()
clf_rc.fit(X_train, Y_train)
acc_rc = round(clf_rc.score(X_train, Y_train)*100, 2)
print(acc_rc)

79.8

In [36]:
#5. KNN classifier
from sklearn.neighbors import KNeighborsClassifier

clf_knn = KNeighborsClassifier(n_neighbors=3)
clf_knn.fit(X_train, Y_train)
acc_knn = round(clf_knn.score(X_train, Y_train)*100, 2)
print(acc_knn)

84.74

In [37]:
Y_pred = clf_svm.predict(X_test)

In [38]:
#output the prediction result into submission.csv and upload into kaggle
df = pd.DataFrame({'PassengerId': test.PassengerId, 'Survived': Y_pred})
df.to_csv("submission.csv", index=False)
print("Your submission was successfully saved!")

Your submission was successfully saved!